# St7GetBeamLabelStyle

Returns the display style for beam labels.

long St7GetBeamLabelStyle(long uID, long* LabelStyle)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
LabelStyle

One of lsNone, lsEntityNumber, lsIDNumber, lsPropertyNumber, lsPropertyName or lsPropertyType.

Strand7 API Manual